098_Мастер_Ра_разработка/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начислено</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислениеУдержание</name>
      <type>
        <types>CatalogRef.НачисленияИУдержания</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/AccumulationRegisters/Касса/Касса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Касса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ФормыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/Enums/НачисленияУдержания/НачисленияУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НачисленияУдержания</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
</mdclass:Enum>

098_Мастер_Ра_разработка/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>Банк</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондентскийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРасчетногоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтвественныйМенеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентМенеджера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПоставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПрочий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>CatalogRef.ФормыСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бренды</name>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Бренды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыВыполняемыхРабот</name>
    <attributes>
      <name>РаботыСубподрядчика</name>
      <type>
        <types>CatalogRef.РаботыСубподрядчика</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доставка</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

098_Мастер_Ра_разработка/src/Documents/НачислениеЗарплаты/ManagerModule.bsl
// @strict-types


Процедура Печать(ТабДок, ПараметрКоманды) Экспорт 
	
	табСотрудников = ПараметрКоманды.Начислено.Выгрузить();
	табСотрудников.Свернуть("Сотрудник,Должность","СуммаНачислено");
	
	ЕстьШП = Ложь;
	ЕстьТО = Ложь;
	
	Для Каждого стрТаб из табСотрудников Цикл 
		
		Макет = ПолучитьМакет("Макет");
		
		ЗапросНаправление = Новый Запрос;
		ЗапросНаправление.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачислено.Сотрудник
		|ИЗ
		|	Документ.НачислениеЗарплаты.Начислено КАК НачислениеЗарплатыНачислено
		|ГДЕ
		|	НачислениеЗарплатыНачислено.НачислениеУдержание.Направление = &Направление
		|	И НачислениеЗарплатыНачислено.Сотрудник = &Сотрудник
		|	И НачислениеЗарплатыНачислено.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗарплатыНачислено.Сотрудник";
		
		ЗапросНаправление.УстановитьПараметр("Направление", Справочники.Направления.НайтиПоНаименованию("ШП"));	
		ЗапросНаправление.УстановитьПараметр("Сотрудник", стрТаб.Сотрудник);
		ЗапросНаправление.УстановитьПараметр("Ссылка", ПараметрКоманды.Ссылка);
		
		РезультатНаправление = ЗапросНаправление.Выполнить();	
		ВыборкаНаправление = РезультатНаправление.Выбрать();	
		Пока ВыборкаНаправление.Следующий() Цикл
			ЕстьШП = Истина;
		КонецЦикла;
		
		Если ЕстьШП Тогда //ШП
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Период 		= ПараметрКоманды.ПериодНачисления; 
			ФИО = стрТаб.Сотрудник.Фамилия+" "+стрТаб.Сотрудник.Имя+" "+стрТаб.Сотрудник.Отчество;
			ОбластьМакета.Параметры.Сотрудник 	= ФИО;
			ОбластьМакета.Параметры.Должность 	= стрТаб.Должность;
			ОбластьМакета.Параметры.Направление 	= "ШП";		
			ТабДок.Вывести(ОбластьМакета);
			
			сч=1;
			Отбор = Новый Структура;
			Отбор.Вставить("Сотрудник",стрТаб.Сотрудник);
			Строки = ПараметрКоманды.Начислено.НайтиСтроки(Отбор);
			
			ВсегоНачислено = 0;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ШП") Тогда 
						ВсегоНачислено = ВсегоНачислено+стрТЧ.СуммаНачислено;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Начислено всего, в т.ч.";
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено;
			ТабДок.Вывести(ОбластьМакета);
			
			ОблМакетаНач	= Макет.ПолучитьОбласть("Начисление");		
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ШП") Тогда 
						ОблМакетаНач.параметры.пп = Сч;
						ОблМакетаНач.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаНач.параметры.Сумма	 	= стрТЧ.СуммаНачислено;	
						ОблМакетаНач.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ТабДок.Вывести(ОблМакетаНач);
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
						
			ОблМакета	= Макет.ПолучитьОбласть("Область1");
			ТабДок.Вывести(ОблМакета);
			
			ОблМакетаВып	= Макет.ПолучитьОбласть("Вычет");
			ВсегоУдержано = 0;
			сч=1;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Удержание Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ШП") Тогда 
						ОблМакетаВып.параметры.пп 			= Сч;
						ОблМакетаВып.параметры.Дата		 	= ПараметрКоманды.дата;
						ОблМакетаВып.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаВып.параметры.Сумма	 	= -стрТЧ.СуммаНачислено;
						ОблМакетаВып.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ОблМакетаВып.параметры.Форма	 	= "нал";
						ТабДок.Вывести(ОблМакетаВып);
						ВсегоУдержано = ВсегоУдержано + стрТЧ.СуммаНачислено;
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Контр = Справочники.Контрагенты.НайтиПоНаименованию(стрТаб.Сотрудник);
			
			Если ЗначениеЗаполнено(Контр) Тогда 
				
				//Найдем авансы по ЗП
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	КассаОбороты.Регистратор,
				|	КассаОбороты.СуммаОборот,
				|	КассаОбороты.Регистратор.НаименованиеРасхода,
				|	КассаОбороты.Регистратор.Период,
				|	КассаОбороты.Регистратор.ВидПлатежаФакт,
				|	КассаОбороты.Направление
				|ИЗ
				|	РегистрНакопления.Касса.Обороты(
				|			,
				|			&КонПериода,
				|			Регистратор,
				|			Месяц = &Период
				|				И (НомерСтатьи = ""24.1""
				|					ИЛИ НомерСтатьи = ""24.2"")
				|				И Направление = &Направление) КАК КассаОбороты
				|ГДЕ
				|	КассаОбороты.Регистратор.Контрагент = &Контрагент
				|
				|УПОРЯДОЧИТЬ ПО
				|	КассаОбороты.Регистратор.Дата";
				
				Запрос.УстановитьПараметр("Период",ПараметрКоманды.ПериодНачисления);
				Запрос.УстановитьПараметр("Контрагент",Контр);
				Запрос.УстановитьПараметр("КонПериода",ПараметрКоманды.дата);
				Запрос.УстановитьПараметр("Направление",Справочники.Направления.НайтиПоНаименованию("ШП"));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() цикл
					ОблМакетаВып.параметры.пп 			= Сч;
					ОблМакетаВып.параметры.Дата		 	= Выборка.Регистратор.дата;
					ОблМакетаВып.параметры.Назначение 	= Выборка.РегистраторНаименованиеРасхода;
					ОблМакетаВып.параметры.Сумма	 	= -Выборка.СуммаОборот;	
					ОблМакетаВып.параметры.Форма	 	= Выборка.РегистраторВидПлатежаФакт;
					ОблМакетаВып.параметры.Период       = Выборка.РегистраторПериод;
					ТабДок.Вывести(ОблМакетаВып);
					ВсегоУдержано = ВсегоУдержано + Выборка.СуммаОборот;
					сч=сч+1;
				КонецЦикла;
			иначе
				Сообщить("Контрогент = Сотруднику: "+стрТаб.Сотрудник+" не найден в РКО");
			КонецЕсли;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Всего, к выплате: ";
			//Если ВсегоНачислено<0 Тогда
			//	ВсегоНачислено = - ВсегоНачислено;
			//КонецЕсли;	
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено+ВсегоУдержано;
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ЗапросНаправление.УстановитьПараметр("Направление", Справочники.Направления.НайтиПоНаименованию("ТО"));
		ЗапросНаправление.УстановитьПараметр("Сотрудник", стрТаб.Сотрудник);
		ЗапросНаправление.УстановитьПараметр("Ссылка", ПараметрКоманды.Ссылка);
		
		РезультатНаправление = ЗапросНаправление.Выполнить();	
		ВыборкаНаправление = РезультатНаправление.Выбрать();	
		Пока ВыборкаНаправление.Следующий() Цикл
			ЕстьТО = Истина;
		КонецЦикла;	
		
		Если ЕстьТО Тогда //ТО
			ОбластьМакета	= Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.Период 		= ПараметрКоманды.ПериодНачисления; 
			ФИО = стрТаб.Сотрудник.Фамилия+" "+стрТаб.Сотрудник.Имя+" "+стрТаб.Сотрудник.Отчество;
			ОбластьМакета.Параметры.Сотрудник 	= ФИО;
			ОбластьМакета.Параметры.Должность 	= стрТаб.Должность;
			ОбластьМакета.Параметры.Направление = "ТО";		
			ТабДок.Вывести(ОбластьМакета);
			
			сч=1;
			Отбор = Новый Структура;
			Отбор.Вставить("Сотрудник",стрТаб.Сотрудник);
			Строки = ПараметрКоманды.Начислено.НайтиСтроки(Отбор);
			
			ВсегоНачислено = 0;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
				//Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ТО") Тогда 
						ВсегоНачислено = ВсегоНачислено+стрТЧ.СуммаНачислено;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Начислено всего, в т.ч.";
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено;
			ТабДок.Вывести(ОбластьМакета);
			
			ОблМакетаНач	= Макет.ПолучитьОбласть("Начисление");		
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Начисление Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ТО") Тогда 
						ОблМакетаНач.параметры.пп = Сч;
						ОблМакетаНач.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаНач.параметры.Сумма	 	= стрТЧ.СуммаНачислено;	
						ОблМакетаНач.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ТабДок.Вывести(ОблМакетаНач);
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
						
			ОблМакета	= Макет.ПолучитьОбласть("Область1");
			ТабДок.Вывести(ОблМакета);
			
			ОблМакетаВып	= Макет.ПолучитьОбласть("Вычет");
			ВсегоУдержано = 0;
			сч=1;
			для Каждого стрТЧ из Строки цикл
				Если стрТЧ.НачислениеУдержание.НачислениеУдержание = Перечисления.НачисленияУдержания.Удержание Тогда 
					Если стрТЧ.НачислениеУдержание.Направление = Справочники.Направления.НайтиПоНаименованию("ТО") Тогда 
						ОблМакетаВып.параметры.пп 			= Сч;
						ОблМакетаВып.параметры.Дата		 	= ПараметрКоманды.дата;
						ОблМакетаВып.параметры.Назначение 	= стрТЧ.НачислениеУдержание;
						ОблМакетаВып.параметры.Сумма	 	= -стрТЧ.СуммаНачислено;
						ОблМакетаВып.параметры.Период       = ПараметрКоманды.ПериодНачисления;
						ОблМакетаВып.параметры.Форма	 	= "нал";
						ТабДок.Вывести(ОблМакетаВып);
						ВсегоУдержано = ВсегоУдержано + стрТЧ.СуммаНачислено;
						сч=сч+1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Контр = Справочники.Контрагенты.НайтиПоНаименованию(стрТаб.Сотрудник);
			
			Если ЗначениеЗаполнено(Контр) Тогда 
				
				//Найдем авансы по ЗП
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	КассаОбороты.Регистратор,
				|	КассаОбороты.СуммаОборот,
				|	КассаОбороты.Регистратор.НаименованиеРасхода,
				|	КассаОбороты.Регистратор.Период,
				|	КассаОбороты.Регистратор.ВидПлатежаФакт,
				|	КассаОбороты.Направление
				|ИЗ
				|	РегистрНакопления.Касса.Обороты(
				|			,
				|			&КонПериода,
				|			Регистратор,
				|			Месяц = &Период
				|				И (НомерСтатьи = ""24.1""
				|					ИЛИ НомерСтатьи = ""24.2"")
				|				И Направление = &Направление) КАК КассаОбороты
				|ГДЕ
				|	КассаОбороты.Регистратор.Контрагент = &Контрагент
				|
				|УПОРЯДОЧИТЬ ПО
				|	КассаОбороты.Регистратор.Дата";
				
				Запрос.УстановитьПараметр("Период",ПараметрКоманды.ПериодНачисления);
				Запрос.УстановитьПараметр("Контрагент",Контр);
				Запрос.УстановитьПараметр("КонПериода",ПараметрКоманды.дата);
				Запрос.УстановитьПараметр("Направление",Справочники.Направления.НайтиПоНаименованию("ТО"));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() цикл
					ОблМакетаВып.параметры.пп 			= Сч;
					ОблМакетаВып.параметры.Дата		 	= Выборка.Регистратор.дата;
					ОблМакетаВып.параметры.Назначение 	= Выборка.РегистраторНаименованиеРасхода;
					ОблМакетаВып.параметры.Сумма	 	= -Выборка.СуммаОборот;	
					ОблМакетаВып.параметры.Форма	 	= Выборка.РегистраторВидПлатежаФакт;
					ОблМакетаВып.параметры.Период       = Выборка.РегистраторПериод;
					ТабДок.Вывести(ОблМакетаВып);
					ВсегоУдержано = ВсегоУдержано + Выборка.СуммаОборот;
					сч=сч+1;
				КонецЦикла;
			иначе
				Сообщить("Контрогент = Сотруднику: "+стрТаб.Сотрудник+" не найден в РКО");
			КонецЕсли;
			
			ОбластьМакета	= Макет.ПолучитьОбласть("Итого");
			ОбластьМакета.параметры.Дата 		= ПараметрКоманды.дата; 
			ОбластьМакета.параметры.Назначение 	= "Всего, к выплате: ";
			ОбластьМакета.параметры.Сумма	 	= ВсегоНачислено+ВсегоУдержано;
			ТабДок.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
